package txai

// 语义解析使用到的枚举列表

// NlpWordcomIntentNames 意图编码-名列表
var NlpWordcomIntentNames = map[int]string{
	0: "未知",
	1: "天气",
	2: "音乐",
	3: "股票",
	4: "新闻",
}

// NlpWordcomComTypeNames 成分编码-名列表
var NlpWordcomComTypeNames = map[int]string{
	0:   "未知",
	1:   "歌词",
	2:   "下载地址",
	3:   "乐器",
	4:   "歌曲",
	5:   "人名",
	6:   "时间",
	7:   "地点",
	8:   "风格",
	9:   "数字",
	10:  "视频",
	11:  "民族",
	12:  "专辑",
	13:  "序数词",
	14:  "综艺",
	15:  "乐队",
	16:  "景点",
	17:  "电影",
	18:  "电视剧",
	19:  "百科",
	34:  "股票名称",
	35:  "股票代码",
	36:  "指数",
	37:  "价格",
	38:  "行情",
	40:  "山",
	41:  "湖",
	42:  "是否",
	43:  "餐馆",
	44:  "菜名",
	45:  "儿歌",
	46:  "故事",
	47:  "相声",
	48:  "评书",
	49:  "有声内容",
	128: "类别词",
	129: "关系词",
	130: "省略词",
}
